3 Weeks Series/Auxiliary Post Processing/swakexpressionpitzdaily/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    absolutePressureStats
    {
        type swakExpression;
        valueType internalField;
        variables (
            "rhoAir=1.2041;"
            "refP=101325;"
        );
        expression "p*rhoAir + refP";
        accumulations (
            average
            weightedAverage
            median
            weightedMedian
            quantile0.50
            weightedQuantile0.50
            quantile0.75
            weightedQuantile0.75
        );
        verbose true;
        outputControlMode   outputTime;
    }
}

libs (
  "libsimpleSwakFunctionObjects.so"
  "libswakFunctionObjects.so"
);

// ************************************************************************* //
